Tekla Open API Reference for Tekla Structures 2025
AnalysisMember.End Property
 Gets or sets the analysis beam end settings at the end of the member.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisBeamEnd End { get; set; }
Public Property End As AnalysisBeamEnd
	Get
	Set
Property Value
Type: AnalysisBeamEnd
See Also
Reference
AnalysisMember Class
Tekla.Structures.Analysis Namespace